Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: To convert in the reverse direction -- that is, from a formatted date/time to YYYYMMDDHH24MISS format -- see www.autohotkey.com/forum/topic20405.html
ja: 逆方向の変換、つまり、フォーマットされた日付/時刻から YYYYMMDDHH24MISS フォーマットへの変換は、www.autohotkey.com/forum/topic20405.htmlをご覧ください。

source: To convert the GUI back into a top-level window, use -Parent.
ja: GUIをトップレベルのウィンドウに戻すには、-Parentを使用します。

source: To convert the case of a subpattern, follow the $ with one of the following characters:
ja: サブパターンの大文字と小文字を変換するには、$の後に次のいずれかの文字を記述します：

source: To convert the case of a subpattern, follow the $ with one of the following characters: U or u (uppercase), L or l (lowercase), T or t (title case, in which the first letter of each word is capitalized but all others are made lowercase).
ja: サブパターンの大文字と小文字を変換するには、$の後に次のいずれかの文字を記述します：Uまたはu（大文字）、Lまたはl（小文字）、Tまたはt（タイトルケース、各単語の最初の文字を大文字にし、他を小文字にしたもの）。

source: To copy a single folder (including its subfolders), use DirCopy.
ja: 1つのフォルダ（サブフォルダを含む）をコピーする場合は、DirCopyを使用します。

source: To count all windows on the system, omit all four title/text parameters.
ja: システム上のすべてのウィンドウをカウントするには、4つのtitle/textパラメータをすべて省略する。

source: To create a closure, simply define a nested function which refers to variables of the outer function.
ja: クロージャを作るには、外側の関数の変数を参照する入れ子関数を定義するだけです。

source: To create a key without writing any values to it, use RegCreateKey.
ja: 値を書き込まずにキーを作成するには、RegCreateKeyを使用します。

source: To create a multi-line tooltip, use the linefeed character (`n) in between each line, e.g. "Line1`nLine2".
ja: 複数行のツールチップを作成するには、各行の間に改行文字(`n)を使用します（例："Line1`nLine2"）。

source: To create hotkey variants dynamically (while the script is running), see HotIf.
ja: ホットキーのバリエーションを動的に（スクリプトの実行中に）作成するには、HotIfを参照してください。

source: To create subkeys in the 64-bit sections of the registry in a 32-bit script or vice versa, use SetRegView.
ja: 32ビットスクリプトでレジストリの64ビットセクションにサブキーを作成する場合、またはその逆の場合は、SetRegViewを使用します。

source: To define a hotstring, enclose the triggering abbreviation between pairs of colons as in this example:
ja: ホットストリングを定義するには、次の例のように、トリガーとなる略語をコロンのペアで囲みます：

source: To define this key as a hotkey, follow this example:
ja: このキーをホットキーとして定義するには、次の例に従います：

source: To delete a key, use RegDeleteKey (new).
ja: キーを削除するには、RegDeleteKey(new)を使用します。

source: To delete a read-only file, first remove the read-only attribute.
ja: 読み取り専用ファイルを削除するには、まず読み取り専用属性を削除します。

source: To delete a separator line, identify it by its position in the menu.
ja: セパレータラインを削除するには、メニュー内の位置で識別します。

source: To delete entries from the 64-bit sections of the registry in a 32-bit script or vice versa, use SetRegView.
ja: 32ビットスクリプトでレジストリの64ビットセクションのエントリを削除する場合、またはその逆の場合は、SetRegView関数を使用します。

source: To deselect all entries in a ListBox or ComboBox, specify 0.
ja: ListBoxやComboBoxの全項目を非選択にする場合は、0を指定します。

source: To detect those controller inputs for other active windows, use the XInput.ahk library.
ja: 他のアクティブウィンドウのコントローラ入力を検出するには、XInput.ahkライブラリを使用する。

source: To detect when the user clicks the text, use the Click event.
ja: ユーザーがテキストをクリックしたことを検出するには、Click イベントを使用します。

source: To detect when the user has pressed Enter while a ListView has focus, use a default button (which can be hidden if desired).
ja: ListViewにフォーカスがある状態でユーザーがEnterを押したことを検出するには、デフォルトのボタンを使用します（必要に応じて非表示にすることができます）。

source: To detect when the user has pressed Enter while a TreeView has focus, use a default button (which can be hidden if desired).
ja: TreeViewにフォーカスがある状態でユーザーがEnterを押したことを検出するには、デフォルトのボタンを使用します（必要に応じて非表示にすることができます）。

source: To detect whether a character or string is entirely uppercase or lowercase, use the IsUpper, IsLower or RegExMatch function.
ja: 文字や文字列がすべて大文字か小文字かを検出するには、IsUpper関数、IsLower関数、RegExMatch関数を使用する。

source: To determine if a value can be converted to a floating-point number, use the IsNumber function.
ja: ある値が浮動小数点数に変換できるかどうかを調べるには、IsNumber関数を使用します。

source: To determine if a value can be converted to a number, use the IsNumber function.
ja: ある値が数値に変換できるかどうかを判断するには、IsNumber関数を使用します。

source: To determine if a value can be converted to an integer, use the IsNumber function.
ja: ある値が整数に変換できるかどうかを判断するには、IsNumber関数を使用します。

source: To determine the amount of time between two dates or times, see DateDiff, which gives an example.
ja: 2つの日付や時刻の間の時間量を求めるには、例を挙げたDateDiffを参照してください。

source: To determine the computer's public IP address, use an external web API.
ja: コンピュータのパブリックIPアドレスを調べるには、外部のウェブAPIを使用する。

source: To determine these numbers, use the controller test script.
ja: これらの数値を決定するには、コントローラのテストスクリプトを使用します。

source: To determine whether a particular hotkey uses the keyboard hook, use ListHotkeys.
ja: 特定のホットキーがキーボードフックを使用しているかどうかを判断するには、ListHotkeysを使用します。

source: To determine whether an object appears to be callable, use one of the following:
ja: オブジェクトが呼び出し可能かどうかを判断するには、以下のいずれかを使用する：

source: To determine which button the user pressed, use the function's return value.
ja: ユーザーがどのボタンを押したかを判断するには、関数の戻り値を使用します。

source: To determine which notifications are available (if any), refer to the control's documentation.
ja: どの通知が利用可能か（もしあれば）については、コントロールのマニュアルを参照してください。

source: To determine which notifications are available (if any), what type of structure they provide and how they interpret the return value, refer to the control's documentation.
ja: どの通知が利用可能か（もしあれば）、どのような構造を提供し、どのように戻り値を解釈するかについては、コントロールのドキュメントを参照してください。

source: To directly add a key and value, just set a key that doesn't exist yet.
ja: キーと値を直接追加するには、まだ存在しないキーを設定すればよい。

source: To directly install to the DESTINATION directory, use /installto or /to (the two switches are interchangeable) as shown below, from within the source directory.
ja: DESTINATIONディレクトリーに直接インストールするには、ソース・ディレクトリー内から、以下のように/installtoまたは/to（2つのスイッチは交換可能）を使用する。

source: To disable timers without pausing the script, use Thread "NoTimers".
ja: スクリプトを一時停止せずにタイマーを無効にするには、Thread "NoTimers"を使用します。

source: To disable timers without pausing the script, use Thread NoTimers.
ja: スクリプトを一時停止せずにタイマーを無効にするには、Thread NoTimersを使用します。

source: To disable DPI scaling, use MyGui.Opt("-DPIScale").
ja: DPIスケーリングを無効にするには、MyGui.Opt("-DPIScale")を使用します。

source: To disable a key rather than remapping it, make it a hotkey that simply returns.
ja: キーをリマップするのではなく、無効にするには、単にreturnsホットキーにします。

source: To disable all special treatment of ampersands, include 0x80 in the control's options.
ja: アンパサンドに対する特別な処理をすべて無効にするには、コントロールのオプションに0x80を含めます。

source: To disable key history, use the following:
ja: キーヒストリーを無効にする場合は、次のようにします：

source: To disable or change an application's non-global hotkey (that is, a shortcut key that only works when that application is the active window), consider the following example which disables Ctrl+P (Print) only for Notepad, leaving the key in effect for all other types of windows:
ja: アプリケーションの非グローバルホットキー（つまり、そのアプリケーションがアクティブウィンドウであるときにのみ機能するショートカットキー）を無効にしたり変更したりするには、次の例を参考にしてください。Ctrl+P（印刷）をメモ帳でのみ無効にし、他のすべての種類のウィンドウでは有効なままにしておきます：

source: To disable selected hotkeys or hotstrings automatically based on any condition, such as the type of window that is active, use #HotIf.
ja: アクティブなウィンドウの種類などの条件に基づいて、選択したホットキーやホットストリングを自動的に無効にするには、#HotIfを使用します。

source: To disable sorting for all columns rather than only a subset, include NoSort in the ListView's options.
ja: 一部の列だけでなく、すべての列のソートを無効にするには、リストビューのオプションにNoSortを含めます。

source: To disable the warning dialog entirely, assign A_HotkeyInterval := 0.
ja: 警告ダイアログを完全に無効にするには、A_HotkeyInterval := 0を指定します。

source: To disable the warning dialog entirely, use A_HotkeyInterval := 0.
ja: もしも警告ダイアログを全く表示させないようにするには、 A_HotkeyInterval := 0としてください。

source: To discover more about how to use a particular message (e.g. WM_VSCROLL), look it up at Microsoft Docs or with a search engine of your choice.
ja: 特定のメッセージ（例：WM_VSCROLL）の使い方を詳しく知りたい場合は、Microsoft Docsや、お好みの検索エンジンで調べてください。

source: To discover the ClassNN or HWND of the control that the mouse is currently hovering over, use MouseGetPos.
ja: 現在マウスが乗っているコントロールのClassNNまたはHWNDを検出するには、MouseGetPosを使用します。

source: To discover the HWND of a control (for use with PostMessage, SendMessage or DllCall), use ControlGetHwnd or MouseGetPos.
ja: コントロールのHWNDを検出するには（PostMessage、SendMessage、またはDllCallで使用するため）、ControlGetHwndまたはMouseGetPosを使用します。

source: To discover the capabilities of the sound devices installed on the system -- such as the names and available components -- run the soundcard analysis script.
ja: システムにインストールされているサウンドデバイスの機能（名前や使用可能なコンポーネントなど）を調べるには、サウンドカード解析スクリプトを実行します。

source: To discover the dimensions of other monitors in a multi-monitor system, use SysGet.
ja: マルチモニターシステムの他のモニターの寸法を調べるには、SysGetを使用する。

source: To discover the name of the window and control that the mouse is currently hovering over, use MouseGetPos.
ja: マウスが現在カーソルを置いているウィンドウとコントロールの名前を知るには、MouseGetPosを使います。

source: To discover the name of the window that the mouse is currently hovering over, use MouseGetPos.
ja: いマウスが現在ホバーしているウィンドウの名前を知るには、MouseGetPosを使います。

source: To discover the unique ID number of the window that the mouse is currently hovering over, use MouseGetPos.
ja: 現在マウスが乗っているウィンドウの固有のID番号を知るには、MouseGetPosを使う。

source: To discover which items in a TreeView are currently checked, call the GetNext method or Get method.
ja: TreeViewのどのアイテムが現在チェックされているかを調べるには、GetNextメソッドまたはGetメソッドを呼び出します。

source: To dismiss the parameter list, press Esc or Enter.
ja: パラメータリストを解除するには、EscまたはEnterを押す。

source: To display a blank icon, specify -1 or a number that is larger than the number of icons in the ImageList.
ja: 空白のアイコンを表示する場合は、-1またはImageListのアイコンの数より大きい数を指定する。

source: To display a blank icon, specify a number that is larger than the number of icons in the ImageList.
ja: 空白のアイコンを表示するには、ImageList のアイコンの数より大きい数を指定します。

source: To display a literal ampersand inside the control types mentioned above, specify two consecutive ampersands as in this example:
ja: 上記のコントロールタイプの中にリテラルなアンパサンドを表示するには、この例のように2つの連続したアンパサンドを指定します：

source: To display a literal ampersand inside the control types mentioned above, specify two consecutive ampersands as in this example: MyGui.Add("Button",, "Save && Exit").
ja: 上記のコントロールタイプの中にリテラルなアンパサンドを表示するには、この例のように2つの連続したアンパサンドを指定します：MyGui.Add("Button",, "Save && Exit")。

source: To display a literal ampersand, specify two consecutive ampersands as in this example:
ja: 文字通りのアンパサンドを表示するには、この例のように連続した2つのアンパサンドを指定します：

source: To display a literal ampersand, specify two consecutive ampersands as in this example: "Save && Exit"
ja: 文字通りのアンパサンドを表示するには、この例のように連続した2つのアンパサンドを指定します："Save && Exit"

source: To display an icon in the message box, add one of the following values:
ja: メッセージボックスにアイコンを表示するには、次の値のいずれかを追加します：

source: To display icons in this mode, the ListView must have a large-icon ImageList assigned to it.
ja: このモードでアイコンを表示するには、ListViewに大きなアイコンのImageListが割り当てられている必要があります。

source: To do all of this, they add special meaning to the following symbols:
ja: そのために、次のようなシンボルに特別な意味を持たせている。

source: To do all of this, they add special meaning to the following symbols: ^!+#{}
ja: そのために、次のようなシンボルに特別な意味を持たせている：^!+#{}

source: To do this, create the picture control after the ListView and include 0x4000000 (which is WS_CLIPSIBLINGS) in the picture's Options.
ja: リストビューの後にピクチャコントロールを作成し、ピクチャのオプションに0x4000000（WS_CLIPSIBLINGSです）を記述します。

source: To do this, include the following line near the top of the script:
ja: そのためには、スクリプトの先頭付近に以下の行を記述します：

source: To do this, replace the following line:
ja: これを行うには、以下の行を置き換える：

source: To do this, you can use the {Blind} prefix.
ja: そのためには、接頭辞として{Blind}を使用することができます。

source: To do this, you will need to use one of the fancy commands with a # in-front of them, namely #HotIf, combined with the built-in function WinActive or WinExist:
ja: これを行うには、#が前に付いた洒落た指令、#HotIfを、組み込み関数WinActiveまたはWinExistと組み合わせて使う必要がある：

source: To download to a variable instead, see the example below.
ja: 代わりに変数にダウンロードする場合は、以下の例を参照してください。

source: To easily add, remove or toggle styles, pass a numeric string prefixed with a plus sign (+), minus sign (-) or caret (^), respectively.
ja: スタイルの追加、削除、切り替えを簡単に行うには、プラス記号（+）、マイナス記号（-）、キャレット（^）をそれぞれ先頭に持つ数値列を渡します。

source: To easily turn on, turn off or toggle attributes, prefix one or more of the following attribute letters with a plus sign (+), minus sign (-) or caret (^), respectively:
ja: アトリビュートのオン、オフ、トグルを簡単に行うには、以下のアトリビュート文字の1つ以上の前に、それぞれプラス記号（+）、マイナス記号（-）、キャレット（^）を付けます：

source: To edit a row, select it then press F2 (see the WantF2 option below).
ja: 行を編集するには、行を選択してからF2キーを押します（下記のWantF2オプションを参照してください）。

source: To edit an item, select it then press F2 (see the WantF2 option below).
ja: 項目を編集するには、項目を選択してからF2キーを押します（下記のWantF2オプションを参照）。

source: To elevate a process, use Run *RunAs instead.
ja: プロセスを昇格させるには、代わりにRun *RunAsを使用します。

source: To enable interactive debugging, first launch a supported debugger client then launch the script with the /Debug command-line switch.
ja: 対話型デバッグを有効にするには、まずサポートされているデバッガークライアントを起動し、/Debugコマンドラインスイッチを使用してスクリプトを起動します。

source: To enable per-monitor DPI awareness, call the following function prior to using functions that are normally affected by DPI scaling:
ja: モニターごとのDPI認識を有効にするには、通常DPIスケーリングの影響を受ける関数を使用する前に、以下の関数を呼び出します：

source: To enable transparency, specify a number between 0 and 255 indicating the degree of transparency:
ja: 透明度を有効にするには、0から255の間で透明度を示す数値を指定する：

source: To enable transparency, specify a number between 0 and 255 indicating the degree of transparency: 0 makes the window invisible while 255 makes it opaque.
ja: 透明度を有効にするには、0から255の間で透明度を示す数値を指定する：0はウィンドウを不可視にし、255は不透明にする。

source: To encapsulate a service or set of services, allowing other parts of the script to focus on a task rather than how that task is carried out.
ja: サービスやサービスの集合をカプセル化し、スクリプトの他の部分が、そのタスクの実行方法ではなく、タスクに集中できるようにします。

source: To enhance performance, only the winning branch is evaluated (see short-circuit evaluation).
ja: パフォーマンスを向上させるため、勝利した分岐のみが評価される（短絡評価を参照）。

source: To ensure a particular ordering, use the Sort function as shown in the Examples section below.
ja: 特定の順序を確保するためには、以下の「例」のようにソート機能を使用します。

source: To ensure correct functionality, this function also sets the input focus to the control.
ja: 正しく機能させるために、この関数はコントロールにフォーカスします。

source: To ensure that a language-dependent IME works, check SM_DBCSENABLED and the system ANSI code page.
ja: 言語依存のIMEが動作することを確認するには、SM_DBCSENABLEDとシステムのANSIコード・ページをチェックしてください。

source: To ensure that the dialog is properly shown, ensure that no illegal characters are present (such as /<|:").
ja: ダイアログが正しく表示されるように、不正な文字（/<|: "など）が存在しないことを確認してください。

source: To enumerate own properties without calling property getters, or to enumerate all properties regardless of type, pass only a single variable to the for-loop or enumerator.
ja: プロパティゲッターを呼ばずに自分のプロパティを列挙したり、型に関係なくすべてのプロパティを列挙するには、forループやenumeratorに単一の変数のみを渡します。

source: To evaluate a property name as an expression, enclose it in percent signs.
ja: プロパティ名を式として評価する場合は、パーセント記号で囲みます。

source: To explicitly or conditionally omit a parameter in more general cases, use the unset keyword.
ja: より一般的なケースで明示的または条件付きでパラメータを省略するには、unsetキーワードを使用します。

source: To extract individual lines or substrings, use functions such as InStr and SubStr.
ja: 個々の行や部分文字列を抽出するには、InStrや SubStrなどの関数を使用する。

source: To extract text from external ListViews (those not owned by the script), use ListViewGetContent.
ja: 外部のListView（スクリプトが所有していないもの）からテキストを抽出するには、ListViewGetContentを使用します。

source: To extract the files one by one, follow this example:
ja: ファイルを1つずつ取り出す場合は、この例に従ってください：

source: To extract the individual files, see the example at the bottom of this page.
ja: 個々のファイルを取り出すには、このページ下部の例を参照してください。

source: To facilitate sharing scripts, #Include can search a few standard locations for a library script.
ja: スクリプトの共有を容易にするために、#Includeはライブラリスクリプトのいくつかの標準的な場所を検索することができます。

source: To find other useful controller scripts, visit the AutoHotkey forum.
ja: 他の便利なコントローラスクリプトを見つけるには、AutoHotkeyフォーラムをご覧ください。

source: To find out the current selection, call the GetSelection method.
ja: 現在の選択範囲を知るには、GetSelectionメソッドを呼び出します。

source: To fix this, do one of the following:
ja: この問題を解決するには、次のいずれかを行ってください：

source: To fix this, do one of the following: 1) Pass MyVar as a "Str" argument rather than as a Ptr/address; 2) Call VarSetStrCapacity(&MyVar, -1) to update the variable's internally-stored length after calling DllCall.
ja: この問題を解決するには、次のいずれかを行ってください：1)MyVarをPtr/アドレスとしてではなく、"Str"引数として渡す。2) DllCallを呼び出した後、VarSetStrCapacity(&MyVar, -1)を呼んで変数の内部に保存された長さを更新します。

source: To focus the control, use the Focus method.
ja: コントロールにフォーカスするには、Focus methodを使用してください。

source: To force the callbacks to execute immediately, use a short delay such as Sleep 20 after changing the clipboard.
ja: コールバックを直ちに実行させるには、クリップボードを変更した後、Sleep 20<//c0> のような短い遅延を使用します。

source: To force the functions to execute immediately, use a short delay such as Sleep 20 after changing the clipboard.
ja: 即座に実行させたい場合は、クリップボード変更後にSleep20などの短いディレイを使用します。

source: To freeze (or unfreeze) the current icon, use the function as follows:
ja: 現在のアイコンをフリーズ（またはフリーズ解除）するには、以下の機能を使用します：

source: To freeze (or unfreeze) the current icon, use the function as follows: TraySetIcon(,, true).
ja: 現在のアイコンをフリーズ（またはフリーズ解除）するには、以下の機能を使用します：TraySetIcon(,, true)。

source: To generate ANSI characters (standard in most languages), specify a number between 128 and 255, but precede it with a leading zero, e.g. {Asc 0133}.
ja: ANSI文字（ほとんどの言語で標準）を生成するには、128から255までの数字を指定しますが、その前に先頭の0を付けます（例：{Asc 0133}）。

source: To generate ASCII characters, specify a number between 1 and 255.
ja: ASCII文字を生成する場合は、1～255の数字を指定します。

source: To get BN_DBLCLK notification codes, the button must have the BS_RADIOBUTTON or BS_OWNERDRAW style.
ja: BN_DBLCLK通知コードを得るために、ボタンはBS_RADIOBUTTONかBS_OWNERDRAWスタイルでなければなりません。

source: To get a list of all built-in functions, see Alphabetical Function Index.
ja: すべての内蔵機能の一覧を得るには、「アルファベット順の機能インデックス」を参照してください。

source: To get an editor added to this page, post in the Suggestions sub-forum or open an Issue or Pull Request at GitHub.
ja: このページにエディタを追加するには、Suggestionsサブフォーラムに投稿するか、GitHubでIssueまたはPull Requestを開いてください。

source: To get more consistent values across different systems, consider using WinGetClientPos instead.
ja: 異なるシステム間でより一貫した値を取得するには、代わりにWinGetClientPosを使用することを検討してください。

source: To get or set control's text/caption instead, use GuiCtrl.Text.
ja: コントロールのテキスト/キャプションを取得/設定するには、GuiCtrl.Textを使用します。

source: To get or set the selected item given its text instead of its position, use GuiCtrl.Text.
ja: 選択されたアイテムの位置ではなく、そのテキストを取得または設定するには、GuiCtrl.Textを使用します。

source: To get the actual code page number, call DllCall("GetACP").
ja: 実際のコードページ番号を取得するには、DllCall("GetACP")を呼び出します。

source: To have a button perform more than one function, put the first function beneath the button name and make the last line a return.
ja: ボタンに複数の機能を持たせるには、最初の機能をボタン名の下に置き、最後の行をreturnにする。

source: To have a script receive a message, use OnMessage.
ja: スクリプトにメッセージを受信させるには、OnMessageを使用します。

source: To have a script respond to movement of a controller's axis or POV hat, use SetTimer and GetKeyState.
ja: コントローラの軸やPOVハットの動きにスクリプトが反応するには、SetTimerと GetKeyStateを使用します。

source: To have multiple files open simultaneously, use FileOpen.
ja: 複数のファイルを同時に開くには、FileOpenを使用します。

source: To have the final line in the section also ended by a join-string, include a blank line immediately above the section's closing parenthesis.
ja: セクションの最終行も結合文字列で終わらせるには、セクションの閉じ括弧のすぐ上に空白行を入れる。

source: To have the message box close automatically if the user has not closed it within a specified time, use the letter T followed by the timeout in seconds, which can contain a decimal point.
ja: 指定した時間内にユーザーがメッセージボックスを閉じなかった場合、自動的に閉じるようにするには、文字Tの後にタイムアウトを秒単位で指定します（小数点以下も可）。

source: To have the original instance detect the failure, follow this example:
ja: 元のインスタンスに障害を検出させるには、この例に従います：

source: To have the script restart itself as admin (or show a prompt to the user requesting admin), use Run *RunAs.
ja: スクリプト自身を管理者として再起動させるには（または管理者を要求するユーザーにプロンプトを表示するには）、Run *RunAsを使用します。

source: To have the system suspend or hibernate, see example #2 at the bottom of this page.
ja: システムをサンペンドまたはハイバネーションにするには、このページの末尾にある例2をご覧ください。

source: To help determine the button numbers for your controller, use this test script.
ja: コントローラのボタン番号を決定するには、以下のテストスクリプトを使用します。

source: To help determine the button numbers for your joystick, use this test script.
ja: ジョイスティックのボタン番号を決定するために、このテストスクリプトを使用してください。

source: To help you learn what ^ and other symbols mean, gaze upon this chart:
ja: ^や他の記号の意味を知るために、この表をご覧ください：

source: To hide a TrayTip balloon window, omit both Text and Title.
ja: TrayTipバルーンウィンドウを隠すには、Textと Titleの両方を省略します。

source: To hide a Windows 10 toast notification, temporarily remove the tray icon.
ja: Windows 10のトースト通知を非表示にするには、トレイアイコンを一時的に削除します。

source: To hold down or release a key, enclose the key name in curly brackets and then use the word UP or DOWN.
ja: キーを押したままにしたり離したりするには、キー名を波括弧で囲み、その後に「UP」または「DOWN」を使用する。

source: To hold down the left or right key instead, replace Alt with LAlt or RAlt.
ja: 左または右のキーを押したままにする場合は、AltをLAltまたはRAltに置き換えてください。

source: To hold down the left or right key instead, replace Ctrl with LCtrl or RCtrl.
ja: 左または右のキーを押したままにするには、CtrlをLCtrlまたはRCtrlに置き換えてください。

source: To hold down the left or right key instead, replace Shift with LShift or RShift.
ja: 左または右のキーを押したままにするには、ShiftをLShiftまたはRShiftに置き換えてください。

source: To identify an existing item by its position in the menu, write the item's position followed by an ampersand.
ja: 既存の項目をメニュー内の位置で識別するには、項目の位置の後にアンパサンドを記述します。

source: To illustrate the above, the mouse wheel can be made into an entire substitute for Alt-tab.
ja: 上記を説明すると、マウスホイールをまるごとAlt-tabの代用品にすることができる。

source: To illustrate the above, there is an example of an on-screen display (OSD) near the bottom of this page.
ja: 上記を説明するために、本ページの下部付近にOSD（オンスクリーンディスプレイ）の例を掲載しています。

source: To illustrate the concept, consider this example:
ja: この概念を説明するために、この例を考えてみましょう：

source: To illustrate the effect of this variable, consider this example:
ja: この変数の効果を説明するために、この例を考えてみましょう。

source: To illustrate the effect of this variable, consider this example: ^!a::Send "abc".
ja: この変数の効果を説明するために、この例を考えてみましょう：^!a::Send "abc"。

source: To illustrate, consider the following hotstring:
ja: 説明のために、次のようなホットストリングを考えてみましょう：

source: To improve performance even more, use LV.Opt("-Redraw") prior to adding a large number of rows and LV.Opt("+Redraw") afterward.
ja: さらにパフォーマンスを向上させるには、大量の行を追加する前にLV.Opt("-Redraw")、追加後にLV.Opt("+Redraw")を使用します。

source: To improve performance, the 100 most recently used regular expressions are kept cached in memory (in compiled form).
ja: パフォーマンスを向上させるため、最近使用された100個の正規表現をメモリ上にキャッシュしておく（コンパイルされた状態）。

source: To improve reliability -- especially during times when the user is physically moving the mouse during the ControlClick -- one or both of the following may help:
ja: 信頼性を高めるために、特にControlClick中にユーザーが物理的にマウスを動かしている場合、以下のどちらか、または両方が有効です：

source: To improve reliability, a delay is done automatically after each use of a Control function that changes a control (except for ControlSetStyle and ControlSetExStyle).
ja: 信頼性を高めるため、コントロールを変更するControl関数を使用するたびに、自動的に遅延が行われます（ControlSetStyleと ControlSetExStyleを除く）。

source: To improve reliability, a delay is done automatically after each use of this function.
ja: 信頼性向上のため、この関数を実行するたびに自動的に遅延が発生します。

source: To improve reliability, a delay is done automatically after every use of this function.
ja: 信頼性向上のため、本機能を使用するたびに自動的に遅延が行われます。

source: To include all windows in a group (except the special Program Manager window), use this example:
ja: グループ内のすべてのウィンドウ（特別なProgram Managerウィンドウを除く）を含めるには、次の例を使用します：

source: To include a back-tick character as data in p2 or p3, double it, i.e. ``.
ja: バックティック文字をp2またはp3のデータとして含めるには、それをダブルにする``。
